:PROPERTIES:
:ID:       20211116T134053.585822
:END:
#+title: DRP PIP Conformance Test Suite
#+filetags: :Project:Work:ConsumerReports:Development:Writing:
#+ARCOLOGY_KEY: doc/drp/conformance
#+AUTHOR: Consumer Reports Digital Lab

This is the working space for the [[http://datarightsprotocol.org/][Data Rights Protocol]] conformance test suite. Right now I'm developing it as an [[https://orgmode.org/worg/org-contrib/babel/intro.html][Literate Programming]] document which feeds short snippets of code in to a BASH shell behind the scenes.

This work product is licensed under the [[file:./LICENSE.md][Apache Software License v2]] and owned by the [[https://digital-lab.consumerreports.org/][Consumer Reports Digital Lab]] until transferred in to a [[http://datarightsprotocol.org/][DRP]] governance organization.

* Test Plan
:PROPERTIES:
:ID:       20220209T171652.987733
:END:
:LOGBOOK:
CLOCK: [2021-12-29 Wed 11:20]--[2021-12-29 Wed 12:50] =>  1:30
:END:

#+PROPERTY: header-args:shell :session *drp-conformance* :results drawer

This thing uses bash, curl, jq, and a bit of python to run conformance validations.

Remember to be in a =poetry shell=, remember to run =poetry install=

#+begin_src shell
poetry install
poetry shell
#+end_src

#+results:
:results:
Spawning shell within /home/rrix/.cache/pypoetry/virtualenvs/datarightsprotocol-SSQrMXUl-py3.9
. /home/rrix/.cache/pypoetry/virtualenvs/datarightsprotocol-SSQrMXUl-py3.9/bin/activate
echo 'org_babel_sh_eoe'
(datarightsprotocol-SSQrMXUl-py3.9)
:end:

These are variables you will want to change when you copy this in to the shell:

#+begin_src shell :results none -r
export DRP_TEST_CACHE=/tmp/drp-test/ # (ref:1)
export JWT_SECRET=my_jwts_are_secure # (ref:2)
export BUSINESS_DOMAIN=example.com   # (ref:3)
#+end_src

The test suite will store response data and other "interstitial" data in the location specified in [[(1)]], this should be Good Enough on POSIX systems. The secret in [[(2)]] is used to sign the JWTs when =genjwts= is invoked. [[(3)]] is used in the Data Rights Discovery Endpoint tests.

*** Discovery Endpoint MUST Be Valid JSON

#+begin_src shell
jq . $DISCOVERY_FILE
#+end_src

#+results:
:results:
{
  "version": "0.4",
  "api_base": "https://example.com/data-rights",
  "actions": [
    "sale:opt-out",
    "sale:opt-in",
    "access",
    "deletion"
  ],
  "user_relationships": []
}
:end:

*** Discovery Endpoint MUST contain a version field

This Conformance Suite runs against version 0.4 of the protocol:

#+begin_src shell
[[ "$(jq -r .version $DISCOVERY_FILE)" = "0.4" ]] \
  || echo "NO VERSION: 0.4"
#+end_src

#+results:
:results:
:end:

*** Discovery Endpoint MUST provide an API base

#+begin_src shell
[[ -n "$(jq -r .api_base $DISCOVERY_FILE)" ]] \
  || echo "NO API_BASE"
export API_BASE=$(jq -r .api_base $DISCOVERY_FILE)
#+end_src

#+results:
:results:

:end:

*** Discovery Endpoint MUST provide a list of actions

#+begin_src shell
[[ ! "$(jq ".actions|length" $DISCOVERY_FILE)" = "0" ]] \
  || echo "NO ACTIONS"
export ACTIONS=$(jq -r ".actions|@sh" $DISCOVERY_FILE | tr -d \')
echo $ACTIONS
#+end_src

#+results:
:results:


sale:opt-out sale:opt-in access deletion
:end:

*** Discovery endpoint MAY contain a =user_relationships= hint set

#+begin_src shell
[[ ! "$(jq ".user_relationships|length" $DISCOVERY_FILE)" = "0" ]] \
  || echo "NO USER_RELATIONSHIPS"
#+end_src

#+results:
:results:

NO USER_RELATIONSHIPS
:end:

